In [2]:
# pandas 사용하기
import numpy as np # numpy 도 함께 import
import pandas as pd

# pandas 자료구조
## Series

In [12]:
# Series 정의하기
obj = pd.Series([4, 7, -5, 3])
obj #index와 values 동시에 확인

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
np.array([4,7,-5,3])

array([ 4,  7, -5,  3])

In [14]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [15]:
obj.index=["one","two","three","four"]

In [16]:
obj

one      4
two      7
three   -5
four     3
dtype: int64

In [7]:
# Series의 자료형 확인하기
obj.dtypes

dtype('int64')

In [9]:
obj2 = pd.Series([4,7,-5,3],index=["d","b","a","c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
# python의 dictionary 자료형을 Series data로 만들 수 있다.
# dictionary의 key가 Series의 index가 된다
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [17]:
#Series의 이름과 index에 이름을 지정
obj3.name = 'Salary'
obj3.index.name = "Names"
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [21]:
# index 변경
obj3.index=["A","B","C","D"]
obj3

A    35000
B    67000
C    12000
D     4000
Name: Salary, dtype: int64

## DataFrame

In [30]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [42]:
# 행 방향의 index
df.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
# 열 방향의 index
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [44]:
# 값 얻기
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [45]:
# 각 인덱스에 대한 이름 설정하기
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [46]:
# DataFrame을 만들면서 columns와 index를 설정할 수 있다.
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'],
                  index=['one', 'two', 'three', 'four', 'five'])
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [47]:
# describe() 함수는 DataFrame의 계산 가능한 값들에 대한 다양한 계산 값을 보여준다.
df2.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [48]:
import numpy as np
import pandas as pd
from pandas import DataFrame as df

In [52]:
#DataFrame 만들기
#0~11까지
df_1 = df(data=np.arange(12).reshape(3, 4),index=['r0', 'r1', 'r2'],
          columns=['c0', 'c1', 'c2', 'c3'],dtype='int',copy=False)
df_1

    c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7
r2   8   9  10  11

In [53]:
#DataFrame 의 Attributes 조회하기

In [57]:
# T : 전치 - 행과 열 바꿔줌
df_1.T

    r0  r1  r2
c0   0   4   8
c1   1   5   9
c2   2   6  10
c3   3   7  11